{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"output_layers": [["conv2d_9", 0, 0], ["conv2d_12", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, null, null, 3]}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 16, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_1", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_1", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "trainable": true, "name": "max_pooling2d_1"}, "name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_2", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_2", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "trainable": true, "name": "max_pooling2d_2"}, "name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_3", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_3", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "trainable": true, "name": "max_pooling2d_3"}, "name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_4", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_4", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "trainable": true, "name": "max_pooling2d_4"}, "name": "max_pooling2d_4", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 256, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_5", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_5", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "trainable": true, "name": "max_pooling2d_5"}, "name": "max_pooling2d_5", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 256, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_6", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_6", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 256, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_7", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_7", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_7", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_10", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_10", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_9", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_9", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_1", "interpolation": "nearest"}, "name": "up_sampling2d_1", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 512, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_8", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_8", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_11", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_11", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_8", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_10", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"trainable": true, "name": "leaky_re_lu_10", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 18, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_9", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_9", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 18, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "trainable": true, "name": "conv2d_12", "bias_constraint": null, "activation": "linear"}, "name": "conv2d_12", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "class_name": "Conv2D"}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of3", "group1-shard2of3", "group1-shard3of3"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 384, 128], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [1, 1, 128, 18], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [18], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [1, 1, 512, 18], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [18], "dtype": "float32"}]}]}